app/Controllers/Anggota.php

    public function index()
    {
        if (!session()->get('login')) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();
        $data['anggota'] = $db->table('anggota')->get()->getResult();
---
SELECT *
FROM `anggota`