app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@karangtarunawaru.com'
---
    public function prosesLogin()
    {
        $session = session();
        $db = \Config\Database::connect();
        $builder = $db->table('users');

        $email    = trim($this->request->getPost('email'));
        $password = trim($this->request->getPost('password'));

        $user = $builder->where('email', $email)->get()->getRow();