app/Controllers/Dashboard.php

SELECT *
FROM `anggota`
SELECT COUNT(*) AS `numrows`
FROM `kegiatan`
SELECT COUNT(*) AS `numrows`
FROM `umkm`
SELECT *
FROM `struktur_organisasi`
ORDER BY `id` DESC
 LIMIT 1
---
    public function index()
    {
        if (!session()->get('login')) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        // Ambil jumlah anggota dari kolom baru
        $anggota = $db->table('anggota')->get()->getRow();
        $totalAnggota = $anggota->jumlah_anggota ?? 0;

        $totalKegiatan = $db->table('kegiatan')->countAllResults();
        $totalUmkm     = $db->table('umkm')->countAllResults();

        // Bagan struktur aktif
        $bagan = $db->table('struktur_organisasi')
                    ->orderBy('id', 'DESC')
                    ->get(1)->getRow();