app/Controllers/Home.php

   public function index()
{
    $db = \Config\Database::connect();
    $anggota = $db->table('anggota')->get()->getRow();
    $data['totalAnggota']  = $anggota->jumlah_anggota ?? 0;
    $data['kegiatan']      = $db->table('kegiatan')->orderBy('tanggal', 'DESC')->limit(3)->get()->getResult();
    $data['totalKegiatan'] = $db->table('kegiatan')->countAll();
    $data['umkm']          = $db->table('umkm')->get()->getResult();
    $data['totalUmkm']     = $db->table('umkm')->countAll();
---
SELECT *
FROM `anggota`
SELECT *
FROM `kegiatan`
ORDER BY `tanggal` DESC
 LIMIT 3
SELECT COUNT(*) AS `numrows` FROM `kegiatan`
SELECT *
FROM `umkm`
SELECT COUNT(*) AS `numrows` FROM `umkm`