app/Controllers/kegiatan.php

SELECT *
FROM `kegiatan`
SELECT *
FROM `foto_kegiatan`
WHERE `kegiatan_id` = '6'
---
    public function index()
    {
        if (!session()->get('login')) {
            return redirect()->to('/login');
        }
        $db = \Config\Database::connect();
        $kegiatan = $db->table('kegiatan')->get()->getResult();

        foreach ($kegiatan as $k) {
            $k->foto_tambahan = $db->table('foto_kegiatan')
                ->getWhere(['kegiatan_id' => $k->id])
                ->getResult();