app/Controllers/umkm.php

SELECT *
FROM `umkm`
---
    public function index()
    {
        $db = \Config\Database::connect();
        $data['umkm'] = $db->table('umkm')->get()->getResult();